<template>
  <div class="about">
    使用过很多笔记软件，最后因为种种原因而决定换掉，最后挑选 Github 作为笔记的载体。<br /><br />
    主要是记一些个人笔记，将比较完整的笔记挑出来展示在网站上，同时记录一些常用的网站导航方便自己使用，如果也能帮助其他人那就更好了。<br /><br />
    至于网站的形式我也尝试过很多，比如 Hexo
    模版类型的博客创作，虽然真的很方便，但个人还是感觉满足不了我的需求，最终选择的实用 vue
    框架自己搭建一套博客网站，同时也会在这个网站上做一些新的技术尝试。
    就像以前有个面试官问我， loadsh
    里面有成熟的方法你为什么不用？而我的回答是：‘如果不是业务、时间强需求，我选择自己写，因为折腾的过程是我想要的’。
    也尝试过 vue
    的一些成熟的模版，虽说有些集成度非常高，但是使用成本和冗余同样变得很高，适合自己的才是最好的，所以我决定自己做动态路由之类的插件，然后按需使用三方库同时去了解和分析它，最后根据自己的需求进行改写或重构。
    做的过程中也想要做到完美再上线，但随着时间的推移我想明白了，所有的东西都是从基本的构思开始，先跑起来，再使用的时候再一步步完善它，这样才能最终得到自己想要的效果，而不是一直自己在那里瞎想。<br /><br />
    ok，就是这样！！！坚持写作！！！奥力给！！！
  </div>
</template>

<style scoped>
.about {
  display: grid;
}
</style>
